Script started on 2023-10-05 20:15:01-04:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="72" LINES="16"]
[?2004hnchan14@remote04:~/i471b/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 9.0.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- f(_,_[8G[K _, X[13G)[5G[14G = f(1, 2, z[26G)[18G[27G.
X = z.

?- head(a, tail(z,B[20G)[16G[21G, Y[24G)[8G[25G =  head(_, tail(X, _[46G)[41G[47G, _[50G)[33G[51G.
X = z.

?- cons(a, cons(b, cons(c, z[29G)[24G[30G[30G)[16G[31G[31G)[8G[32G  = cons(_, cons(_, cons(_, X[61G)[56G[62G[62G)[48G[63G[63G)[40G[64G.
X = z.

?- 
|    ^C
Action (h for help) ? exit (status 4)
[?2004hnchan14@remote04:~/i471b/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 9.0.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [1, 2, 3, 4[15G][4G[16G = [_,  _|X[27G][19G[28G.
X = [3, 4].

?- [1, 2, 3, 4[15G][4G[16G = [_, _,  X|_[30G][19G[31G.
X = 3.

?- [[1, 2[10G][5G[11G, 3, 4[17G][4G[18G = [X|_[25G][21G[26G.
X = [1, 2].

?- e
|    e
|    ^C
Action (h for help) ? exit (status 4)
[?2004hnchan14@remote04:~/i471b/submit/lab6$ cd ~.i4[K[K[K/i471b/submit/lab6
[?2004l[?2004hnchan14@remote04:~/i471b/submit/lab6$ git add .
[?2004l[?2004hnchan14@remote04:~/i471b/submit/lab6$ git commit -m 'completed ex1&2'
[?2004l[lab6 76ea9ee] completed ex1&2
 1 file changed, 0 insertions(+), 0 deletions(-)
 create mode 100644 submit/lab6/lab6.LOG
[?2004hnchan14@remote04:~/i471b/submit/lab6$ git push
[?2004lEnumerating objects: 7, done.
Counting objects:  14% (1/7)Counting objects:  28% (2/7)Counting objects:  42% (3/7)Counting objects:  57% (4/7)Counting objects:  71% (5/7)Counting objects:  85% (6/7)Counting objects: 100% (7/7)Counting objects: 100% (7/7), done.
Delta compression using up to 8 threads
Compressing objects:  25% (1/4)Compressing objects:  50% (2/4)Compressing objects:  75% (3/4)Compressing objects: 100% (4/4)Compressing objects: 100% (4/4), done.
Writing objects:  25% (1/4)Writing objects:  50% (2/4)Writing objects:  75% (3/4)Writing objects: 100% (4/4)Writing objects: 100% (4/4), 368 bytes | 368.00 KiB/s, done.
Total 4 (delta 2), reused 0 (delta 0), pack-reused 0
remote: Resolving deltas:   0% (0/2)[Kremote: Resolving deltas:  50% (1/2)[Kremote: Resolving deltas: 100% (2/2)[Kremote: Resolving deltas: 100% (2/2), completed with 2 local objects.[K
To https://github.com/nicolec27/i471b.git
   d0d8289..76ea9ee  lab6 -> lab6
[?2004hnchan14@remote04:~/i471b/submit/lab6$ s[Kscript -a lab6.LOG
[?2004lScript started, output log file is 'lab6.LOG'.
[?2004hnchan14@remote04:~/i471b/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 9.0.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- N = 1 + 2.
N = 1+2.

?- N is ([9G[K+(1, 2[15G)[10G[16G.
N = 3.

?- N is (1_[11G[K[10G[K[9G[K1 + 2.
N = 3.

?- N is 1 + 2*3.
N = 7.

?- 5 is 7 mod 2.
[1;31mfalse.[0m

?- X is 7 mod 2.
X = 1.

?- X is -7 mod 3.
X = 2.

?- N is sqrt(4[15G)(4).
N = 2.0.

?- N = pi.
N = pi.

?- N is pi.
N = 3.141592653589793.

?- [?- ['lab6-sol.pro[18G'[5G[19G[19G][4G[20G.
[1;31mERROR: /home/nchan14/i471b/submit/lab6/lab6-sol.pro:2:40: Syntax error: Unexpected end of file
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[1mtrue.[0m

?- (?- [Kquadratic_roots(2, 5, 2, Z[30G)[19G[31G.
Z = -0.5.

?- ?- quadratic_roots(2, 5, 2, Z).
Z = -0.5.

?- ?- quadratic_roots(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots(2, 5, 2, Z).
Z = -0.5 [1m.[0m

?- ?- quadratic_roots(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots(2, 5, 2, Z).
Z = -2.0.

?- ?- quadratic_roots(2, 5, 2, Z).
Z = -2.0.

?- ?- quadratic_roots(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots(2, 5, 2, Z).
Z = -2.0 [1m;[0m
Z = -0.5.

?- ?- quadratic_roots(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots(2, 5, 2, Z).
Z = -0.5 [1m;[0m
Z = -2.0.

?- ?- quadratic_roots(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[31mWarning: /home/nchan14/i471b/submit/lab6/lab6-sol.pro:11:
Warning:    Singleton variables: [C]
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots(2, 5, 2, Z).[19G[1@2((2, 5, 2, Z).
[1;31mERROR: Unknown procedure: quad_roots/5
ERROR:   However, there are definitions for:
ERROR:         quad_roots/4
ERROR: 
ERROR: In:
ERROR:   [11] [34mquad_roots(2,5,2,9,_6246)[0m[0m[1;31m
ERROR:    [9] [34mtoplevel_call('<garbage_collected>')[0m[0m[1;31m at /usr/lib/swi-prolog/boot/toplevel.pl:1173
ERROR: 
ERROR: Note: some frames are missing due to last-call optimization.
ERROR: Re-run your program in debug mode (:- debug.) to get more detail.
[0m   [1;35mException: [0m(11) quad_roots(2, 5, 2, 9, _18) ? exit (status 4)
[?2004hnchan14@remote04:~/i471b/submit/lab6$ prolog
[?2004lWelcome to SWI-Prolog (threaded, 64 bits, version 9.0.4)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- ?- quadratic_roots2(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots2(2, 5, 2, Z).
Z = -0.5.

?- ?- quadratic_roots2(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots2(2, 5, 2, Z).
Z = -0.5 [1m;[0m
Z = -2.0.

?- ?- quadratic_roots2(2, 5, 2, Z).?- ['lab6-sol.pro'].[K
[31mWarning: /home/nchan14/i471b/submit/lab6/lab6-sol.pro:18:
Warning:    Singleton variables: [L,NsL,NsSum]
[0m[1mtrue.[0m

?- ?- ['lab6-sol.pro'].
[1mtrue.[0m

?- ?- ['lab6-sol.pro'].?- quadratic_roots2(2, 5, 2, Z).[32G[K[31G[K[30G[K[29G[28G[K[27G[K[26G[25G[K[24G[K[23G[22G[K[21G[K[20G[K[19G[K[18G[K[17G[K[16G[K[15G[K[14G[K[13G[K[12G[K[11G[K[10G[K[9G[K[8G[K[7G[K[6G[K?- q[K?- [Ksum_lengths([[1, 2[22G][17G[23G, [3, [4, 5[34G][29G[35G, 6[38G][25G[39G, [7, 8[46G][41G[47G, [9[51G][9][52G][16G[53G, Z[56G)[15G[57G.
Z = 8.

?- 
[1]+  Stopped                 prolog
[?2004hnchan14@remote04:~/i471b/submit/lab6$ [?2004l
exit
There are stopped jobs.
[?2004hnchan14@remote04:~/i471b/submit/lab6$ cd ~/i471b/submit/lab6
[?2004l[?2004hnchan14@remote04:~/i471b/submit/lab6$ git add .
[?2004l[?2004hnchan14@remote04:~/i471b/submit/lab6$ git commit -m 'completing lab6'
[?2004l[lab6 0890369] completing lab6
 1 file changed, 21 insertions(+)
[?2004hnchan14@remote04:~/i471b/submit/lab6$ git push
[?2004lEnumerating objects: 9, done.
Counting objects:  11% (1/9)Counting objects:  22% (2/9)Counting objects:  33% (3/9)Counting objects:  44% (4/9)Counting objects:  55% (5/9)Counting objects:  66% (6/9)Counting objects:  77% (7/9)Counting objects:  88% (8/9)Counting objects: 100% (9/9)Counting objects: 100% (9/9), done.
Delta compression using up to 8 threads
Compressing objects:  20% (1/5)Compressing objects:  40% (2/5)Compressing objects:  60% (3/5)Compressing objects:  80% (4/5)Compressing obje